#include <iostream>
using namespace std;
 
int main ()
{
   // 一个带有 5 行 2 列的数组
   int a[5][2] = { {0,0}, {1,2}, {2,4}, {3,6},{4,8}};
 
   // 输出数组中每个元素的值                      
   for ( int i = 0; i < 5; i++ )
      for ( int j = 0; j < 2; j++ )
      {
         cout << "a[" << i << "][" << j << "]: ";
         cout << a[i][j]<< endl;
      }
 
   return 0;
}

//初始化 
//int a[3][4] = {0,1,2,3,4,5,6,7,8,9,10,11};
//访问 
//int val = a[2][3]; 



//a[0][0]: 0
//a[0][1]: 0
//a[1][0]: 1
//a[1][1]: 2
//a[2][0]: 2
//a[2][1]: 4
//a[3][0]: 3
//a[3][1]: 6
//a[4][0]: 4
//a[4][1]: 8
